{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report mapping Valentine experience requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of major frontend source files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens, dark mode variants, and global background/foreground application.",
  "frontend/index.html": "Base HTML entry point mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps the ValentineProposal component in a full‑screen container.",
  "frontend/src/components/ValentineProposal.tsx": "Interactive Valentine proposal UI with Yes/No logic, evasive No button, progressive notes, and love letter reveal.",
  "frontend/src/content/valentineCopy.ts": "Centralized content including proposal text, confirmation message, initial notes, progressive notes, and full love letter.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing on identity changes.",
  "frontend/src/hooks/useEvasiveButton.ts": "Hook that calculates new random safe positions and scale effects to make a button evade user interaction.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity loading, and AuthClient setup.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, background gradients, and custom animation utilities for a pink romantic aesthetic.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and the InternetIdentityProvider, then mounts App with global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors from CSS variables, extended theme options, plugins, and animations.",
  "project_state.json": "Describes the project’s state and requirements for a romantic Valentine proposal page, including features, constraints, and design goals."
}