{
  "backend/main.mo": "Empty Motoko actor definition.",
  "feature_evidence.json": "Feature evidence report describing required metadata changes to frontend/index.html.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions with light/dark palettes and global styles.",
  "frontend/index.html": "HTML entry point with updated title and Open Graph meta tags for social sharing.",
  "frontend/src/App.tsx": "Renders the ValentineProposal component inside a full‑screen container.",
  "frontend/src/components/FloatingThoughts.tsx": "Animated floating words and hearts that react to hover and touch states.",
  "frontend/src/components/InteractiveLoveLetter.tsx": "Interactive love‑letter reader revealing paragraphs progressively with navigation and progress indicators.",
  "frontend/src/components/LastChanceNoModal.tsx": "Modal warning shown when clicking No, featuring an angry panda and a confirm‑Yes button.",
  "frontend/src/components/ValentineProposal.tsx": "Main proposal flow with evasive No button, Yes confirmation, progressive notes, and supporting components.",
  "frontend/src/content/valentineCopy.ts": "Centralized text content including proposal question, love notes, progressive notes, and full love letter.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useEvasiveButton.ts": "Computes collision‑free positions for a button to evade obstacles within a container, updating position and scale when enabled.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, persistence, and status handling using Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, animations, and decorative backgrounds for a pink romantic UI theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, plugins, and theme extensions using CSS variables.",
  "project_state.json": "Stores project metadata, feature definitions, and state for managing updates to page title and Open Graph tags."
}