{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update No-modal copy and swap angry cat image for angry panda",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the cat side-eye line from the LastChanceNoModal description without leaving empty spacing.",
      "acceptanceCriteria": [
        "When the No modal is opened, the text \"That cat is giving you the side-eye right now...\" is not present in the DOM or visible UI.",
        "No extra blank spacing/empty paragraph is left where the removed line used to be."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LastChanceNoModal.tsx",
          "operation": "modify",
          "description": "Remove the specific user-facing paragraph that contains \"That cat is giving you the side-eye right now...\" and ensure the DialogDescription layout does not leave an empty <p> or visual gap where it was."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the No modal angry cat image with the generated angry panda asset and update related text/alt text to reference a panda.",
      "acceptanceCriteria": [
        "The No modal image is loaded from a panda asset under /assets/generated/ and no longer references /assets/generated/angry-sideeye-cat.dim_768x768.png.",
        "The image alt text (and any other user-facing references in the modal) refers to a panda, not a cat.",
        "The modal still renders correctly (image sizing/spacing preserved) and the primary/secondary buttons continue to function as before."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/angry-sideeye-panda.dim_768x768.png",
          "operation": "create",
          "description": "Add the newly generated image asset required by the BuildRequest: frontend/public/assets/generated/angry-sideeye-panda.dim_768x768.png."
        },
        {
          "path": "frontend/src/components/LastChanceNoModal.tsx",
          "operation": "modify",
          "description": "Update the modal image src to point to /assets/generated/angry-sideeye-panda.dim_768x768.png, update the image alt text to refer to a panda (not a cat), and adjust any other user-facing cat references in this modal (e.g., the title emoji/text) while preserving existing sizing/spacing classes and button behaviors."
        }
      ]
    }
  ]
}